yii2/frontend/controllers/TestController.php

SELECT COUNT(*) FROM `msg`
SELECT * FROM `msg` LIMIT 2 OFFSET 4
---
	public function actionShow()
	{

		 $data = Msg::find();

       		 $pages = new Pagination(['totalCount' =>$data->count(), 'pageSize' => '2']);
       		 $model = $data->offset($pages->offset)->limit($pages->limit)->all();