yii2/backend/controllers/CustController.php

	public function actionIndex(){
		// $customer = Yii::$app->db->createCommand('SELECT * FROM customer')->queryAll();
		// return $this->render('index',["customer"=>$customer]);
		$query=new Query();
	    $arr=$query->select('*')->from('customer')->all();
	    $count=count($arr);
	    $pagination = new Pagination(['totalCount' => $count]);
	    $pagination->setPageSize(10);
	    $customer = $query->offset($pagination->offset)->limit($pagination->limit)->all();
---
SELECT * FROM `customer`
SELECT * FROM `customer` LIMIT 10