yii2/backend/controllers/YcustController.php

	public function actionIndex(){
		$query=new Query();
	    $arr=$query->select('*')->from('ycustomer')->all();
	    $count=count($arr);
	    $pagination = new Pagination(['totalCount' => $count]);
	    $pagination->setPageSize(10);
	    $ycustomer = $query->offset($pagination->offset)->limit($pagination->limit)->all();
---
SELECT * FROM `ycustomer`
SELECT * FROM `ycustomer` LIMIT 10